In [48]:
import pandas as pd 
import numpy as np 
from sklearn import linear_model
import math

In [49]:
df = pd.read_csv("hiring.csv")
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [51]:
help_dict = {
    'one': 1,
    'two': 2,
    'three': 3,
    'four': 4,
    'five': 5,
    'six': 6,
    'seven': 7,
    'eight': 8,
    'nine': 9,
    'zero': 0,
    'eleven':11
}

In [52]:
df.experience.fillna("zero")

0      zero
1      zero
2      five
3       two
4     seven
5     three
6       ten
7    eleven
Name: experience, dtype: object

In [53]:
df["experience"] = df["experience"].map(help_dict)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0         NaN                    8.0                           9      50000
1         NaN                    8.0                           6      45000
2         5.0                    6.0                           7      60000
3         2.0                   10.0                          10      65000
4         7.0                    9.0                           6      70000
5         3.0                    7.0                          10      62000
6         NaN                    NaN                           7      72000
7        11.0                    7.0                           8      80000

In [56]:
median_exp = df.experience.median()
median_exp

5.0

In [57]:
median_test_sc = df['test_score(out of 10)'].median()
median_test_sc

8.0

In [60]:
df.experience = df.experience.fillna(median_exp)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0         5.0                    8.0                           9      50000
1         5.0                    8.0                           6      45000
2         5.0                    6.0                           7      60000
3         2.0                   10.0                          10      65000
4         7.0                    9.0                           6      70000
5         3.0                    7.0                          10      62000
6         5.0                    NaN                           7      72000
7        11.0                    7.0                           8      80000

In [61]:
df['test_score(out of 10)'] = df['test_score(out of 10)'].fillna(median_test_sc)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0         5.0                    8.0                           9      50000
1         5.0                    8.0                           6      45000
2         5.0                    6.0                           7      60000
3         2.0                   10.0                          10      65000
4         7.0                    9.0                           6      70000
5         3.0                    7.0                          10      62000
6         5.0                    8.0                           7      72000
7        11.0                    7.0                           8      80000

In [63]:
reg = linear_model.LinearRegression()
reg.fit(df[['experience', 'test_score(out of 10)', 'interview_score(out of 10)']], df['salary($)'])

LinearRegression()

In [64]:
reg.predict([[3, 10, 8]])

c:\users\user\appdata\local\programs\python\python39\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([59974.43186407])

In [65]:
reg.coef_

array([3021.49790836, 1819.92473309, 2265.1947087 ])

In [66]:
reg.intercept_

14589.133138436184